{
    "id": "01f654bd55156e17dc0203e93199d60a",
    "page_url": "people-ask-inquiry-treated-muscat-officials-unfairly-pm.1092038",
    "comments": {
      "8ac218662df0da7e": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 8:31 PM",
        "published_date_timestamp": 1715020260,
        "comment": "In money laundering, suspects are automatically guilty and have to prove their innocence, not the other way around.Similar to drug possession.",
        "likes": "24",
        "dislikes": "2",
        "replies": []
      },
      "85e51db0f6dccc28": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 8:35 PM",
        "published_date_timestamp": 1715020500,
        "comment": "Bottomline: \"Continuity.\"",
        "likes": "20",
        "dislikes": "0",
        "replies": []
      },
      "94b88d8caa544521": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 8:35 PM",
        "published_date_timestamp": 1715020500,
        "comment": "In 90 mins, Robert Abela found time time to defend Joseph Muscat and others who stand accused but found no time to defend the victims of the crime i.e. the taxpayer who was robbed of 400 million.",
        "likes": "52",
        "dislikes": "1",
        "replies": [
          {
            "bc227cb52634f441": {
              "author": "[REDACTED]",
              "published_date": "Tuesday, May 7, 2024 7:03 AM",
              "published_date_timestamp": 1715058180,
              "comment": "Bobby has signed his and the Labour party's  own \"Goodbye\" warrant,  by not standing up to prevent corruption but instead to have the gall to  actually defend those involved in what has been proven to be corruption by the highest Courts of this nation.Bye, bye Bobby and cronies   -  even Gahans aren't that stupid and blind that they'll vote for uncaring, selfish, greedy politicians next time round!",
              "likes": "7",
              "dislikes": "0",
              "replies": [
                {
                  "ebfc3d23da8b81bb": {
                    "author": "[REDACTED]",
                    "published_date": "Tuesday, May 7, 2024 9:45 AM",
                    "published_date_timestamp": 1715067900,
                    "comment": "Actually, the Gahans REALLY are that stupid. Never underestimate the power of stupid people in groups.",
                    "likes": "6",
                    "dislikes": "0",
                    "replies": []
                  }
                },
                {
                  "d7e94c2471ad919c": {
                    "author": "[REDACTED]",
                    "published_date": "Tuesday, May 7, 2024 10:51 AM",
                    "published_date_timestamp": 1715071860,
                    "comment": "That's what happens when you are put in place to be someone's puppet like robber is he has no choice JM has him bent over and is just biding his time to use or and abuse him as he sees fit so robber complies to his wishes which he is doing off his own back?",
                    "likes": "1",
                    "dislikes": "0",
                    "replies": []
                  }
                }
              ]
            }
          }
        ]
      },
      "5da3412d5fd268e5": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 8:37 PM",
        "published_date_timestamp": 1715020620,
        "comment": "The Vitals magisterial inquiry is riddled with unjust accusations, said the prime minister, who insisted, however, he had not seen the inquiry which sparked a political earthquake.\"Blessed are those who are spiritually poor [to believe this lie]; for theirs is the kingdom of heaven.\"...for the ignorant it will be rather hell.",
        "likes": "6",
        "dislikes": "0",
        "replies": []
      },
      "837ef392e7e569b3": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 8:41 PM",
        "published_date_timestamp": 1715020860,
        "comment": "And court experts were paid too much in “direct orders”, he added.The sheer brass neck of this guy!But they should ask why things were done that way What way?  We didn't see it like you!The Vitals magisterial inquiry is riddled with unjust accusationsHow do you know ?????Abela also said he expects legal challenges to the inquiry and the way it was carried out,But meanwhile they are charged in court so that's quite irrelevant!Voters will make up their minds about the way the inquiry was carried out once they have seen it, he said.Who cares what they think?  The law has to be upheld even if every voter on this blessed rock thinks otherwise!Abela also said he has no intention of asking Muscat to leave the party or sack him,Like you have the spine to do that ...For me, Fearne was a shoulder to rely on during the pandemic  Go and cry on each other's shoulders then!",
        "likes": "28",
        "dislikes": "1",
        "replies": [
          {
            "6267d99a8511776c": {
              "author": "[REDACTED]",
              "published_date": "Tuesday, May 7, 2024 6:38 AM",
              "published_date_timestamp": 1715056680,
              "comment": "The irony is that he forgot that when he gave consultancy to the govt. He was paid well. That is how the bill goes up, besides that to get access to bank info you have to pay. Haseb li kulhadd gahan liebes l-ahmar. It is unbelievable that he defends Muscat so much perhaps he fears that his misgivings are next.",
              "likes": "3",
              "dislikes": "0",
              "replies": []
            }
          },
          {
            "490062709dd91bc2": {
              "author": "[REDACTED]",
              "published_date": "Tuesday, May 7, 2024 10:54 AM",
              "published_date_timestamp": 1715072040,
              "comment": "That's because robber doesn't have the power to sack him but JM has the power to remove robber?",
              "likes": "1",
              "dislikes": "0",
              "replies": [
                {
                  "8fc61c8788fd1cb7": {
                    "author": "[REDACTED]",
                    "published_date": "Tuesday, May 7, 2024 11:07 AM",
                    "published_date_timestamp": 1715072820,
                    "comment": "Yes, that's true",
                    "likes": "1",
                    "dislikes": "0",
                    "replies": []
                  }
                }
              ]
            }
          }
        ]
      },
      "3e51ad21808fca85": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 8:41 PM",
        "published_date_timestamp": 1715020860,
        "comment": "The whole press conference was a disgrace.Everyone is the establishment besides Labour.At one point he even accused the Newsbook journalist asking him a question of working for the establishment, i.e. the Church is part of the establishment too according to our illustrious prime minister. It's beyond parody.There are a dozen obscene things one could note about the press conference, but the bottom line is that this is the worst prime minister by miles we've ever had and that his dangerous antics are dragging the country to the brink. We can't get rid of him and his rotten party soon enough.",
        "likes": "31",
        "dislikes": "1",
        "replies": [
          {
            "a6c36fe290f8c15b": {
              "author": "[REDACTED]",
              "published_date": "Tuesday, May 7, 2024 6:46 AM",
              "published_date_timestamp": 1715057160,
              "comment": "A drowning man catches at every straw!! Hallina Abela be a gentleman for once and admit it li qed tgerfexx",
              "likes": "2",
              "dislikes": "0",
              "replies": []
            }
          }
        ]
      },
      "928a3bbf8c0fd429": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 8:56 PM",
        "published_date_timestamp": 1715021760,
        "comment": "When asked if he knows the contents of the inquiry he said he doesn't. But when asked if he spoke to anyone mentioned he said he meets with Fearne everyday. So how does he know that Fearne is mentioned?",
        "likes": "9",
        "dislikes": "0",
        "replies": []
      },
      "d5403934c54f4150": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 9:00 PM",
        "published_date_timestamp": 1715022000,
        "comment": "'People should ask why inquiry treated Muscat and other officials unfairly'No, RobertWhat people should ask, and are asking, is:‘Who pocketed the 400 million euros?’",
        "likes": "28",
        "dislikes": "0",
        "replies": []
      },
      "c9065b8b71a430f6": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 9:04 PM",
        "published_date_timestamp": 1715022240,
        "comment": "Pathetic by the minute",
        "likes": "15",
        "dislikes": "1",
        "replies": []
      },
      "51c3b2a2455f021e": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 9:08 PM",
        "published_date_timestamp": 1715022480,
        "comment": "Robert Abela, the Establishment are those who are in power and sit in Castille. That's you. It doesn't get more Establishment than that. And you have failed, no, wronged us all.",
        "likes": "19",
        "dislikes": "0",
        "replies": []
      },
      "4be1023469d96ff2": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 9:12 PM",
        "published_date_timestamp": 1715022720,
        "comment": "Have you read the inquiry or have you not?! What's all this rubbish about an inquiry treating someone fairly or not?Inquiries collect evidence under oath and on that evidence the way forward is charted. If the evidence points that an individual committed a crime than it goes in front of a court of law with a jury of peers under the guidance of a judge where it has to be decided 'without reasonable doubt' that the accused is guilty, or not. That is the place where utmost fairness is expected.An illegality is always illegality and if an illegality is committed by a public official it is automatically and aggravated offence. No one is above the law least of all those who were entrusted with the country's well being. Their good deeds, if any, do not cancel out any crimes they might have committed so stop this dangerous interference with the course of justice. You are neither judge nor jury, get out of the flippin way and leave justice to take its course. The courts are not on the ballot but your criminal political party is. Your party, has always been the party which eroded justice for its political gain, that is the fact.All the people have to ask is  'is there enough evidence, beyond reasonable doubt, that the accused have committed a crime against the country?! and that is done according to the constitution in a court of law.",
        "likes": "13",
        "dislikes": "0",
        "replies": [
          {
            "e1666bf04fd74164": {
              "author": "[REDACTED]",
              "published_date": "Tuesday, May 7, 2024 4:39 AM",
              "published_date_timestamp": 1715049540,
              "comment": ".,,,,in a Democracy, that is.",
              "likes": "2",
              "dislikes": "0",
              "replies": [
                {
                  "a80503415ce4c200": {
                    "author": "[REDACTED]",
                    "published_date": "Tuesday, May 7, 2024 8:16 AM",
                    "published_date_timestamp": 1715062560,
                    "comment": "Democracy is not an object but a state of mind, the way one feels, acts, reasons, and this political party, which is corrupt from its foundation, never believed in the democratic process. How right was the ex minister Charles Mangion when some time ago he blared from a village square \"Dawn mhux bħalna, dawn għandhom DNA differenti.\" How right was that statement.",
                    "likes": "1",
                    "dislikes": "0",
                    "replies": []
                  }
                }
              ]
            }
          },
          {
            "d480cbf204577251": {
              "author": "[REDACTED]",
              "published_date": "Tuesday, May 7, 2024 11:22 AM",
              "published_date_timestamp": 1715073720,
              "comment": "The problem will be getting an unbiased jury for him or against him if it ever gets that's far? And if Robber hasn't seen it how come Victoria handed him the findings and he knows so much what's in it?",
              "likes": "0",
              "dislikes": "0",
              "replies": [
                {
                  "12b28ebfa54dbdea": {
                    "author": "[REDACTED]",
                    "published_date": "Tuesday, May 7, 2024 11:29 AM",
                    "published_date_timestamp": 1715074140,
                    "comment": "The prosecution and the defence will have the possibility, as defined by law, to interview any member of the jury and reject or accept any of them. He knows too much to claim he hasn't read it, but that is his measure.",
                    "likes": "1",
                    "dislikes": "0",
                    "replies": []
                  }
                }
              ]
            }
          }
        ]
      },
      "e106e2505549dc77": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 9:13 PM",
        "published_date_timestamp": 1715022780,
        "comment": "Yes, he has definitely lost the plot, wait for his theory about why the earth is flat..",
        "likes": "13",
        "dislikes": "1",
        "replies": []
      },
      "613288cdd168025c": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 9:17 PM",
        "published_date_timestamp": 1715023020,
        "comment": "An INVALID and BIAS statement declared by the PM.  LET JUSTICE FREE TO TAKE ITS COURSE AND DOES ITS WORK.  DO NOT BE AN INTRUDER. PM DO NOT FORGET THAT you are the Prime Minister of all Maltese citizens, SO DO NOT TRY to influence in your PL party speaches when addressing labourites about the  VITALS/ STEWARD HEATHCARE MATTER which is still ONGOING to find out the truth. Keep always in your mind that you MUST cater for both labourites and Nationalists CITIZENS BEING THEIR PRIME MINISTER FOR BOTH.",
        "likes": "10",
        "dislikes": "1",
        "replies": []
      },
      "d9f96ed45b1b83c7": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 9:19 PM",
        "published_date_timestamp": 1715023140,
        "comment": "I don't believe Abela has an understanding of judicial process. The accused get to defend themselves in court AFTER charges have been laid. They're entitled to know the charges against them, but the forum to challenge them is open court, not horse trading with judges and the Attorney General.He's also clearly confused about the difference between a magisterial inquiry and a criminal investigation. The inquiry can give the opinion that certain people have a criminal case to answer; it cannot charge them, even if the evidence it uncovers is strong. And the evidence must be strong if an official as partisan as the Attorney General loses no time in pressing charges.My own opinion is that Abela is trying to run with the hare and hunt with the hounds, and cover himself whatever the outcome. The risk is that one of his stances will certainly be wrong.",
        "likes": "8",
        "dislikes": "0",
        "replies": []
      },
      "2a01debec9842a83": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 9:34 PM",
        "published_date_timestamp": 1715024040,
        "comment": "This is what I don't understand. So far, this inquiry does not attack anyone who is part of the current Labour Government. So why this panic?",
        "likes": "7",
        "dislikes": "0",
        "replies": []
      },
      "f8478b12fcd57277": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 9:40 PM",
        "published_date_timestamp": 1715024400,
        "comment": "Abela also said he has no intention of asking Muscat to leave the party or sack him,What Abela avoided to say is that Muscat has already been sacked from the Partit Laburista by Fearne",
        "likes": "5",
        "dislikes": "0",
        "replies": []
      },
      "56c602cc2f0b40f9": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 9:45 PM",
        "published_date_timestamp": 1715024700,
        "comment": "If he hasn’t seen it, how can he say what it contains????Direct Order….really, now they bother you???“Until then keep calm…” And after that? Let all hell break loose????This is a true test for moderate Labour voters who still believe in democracy, rule of law and who love Malta more than the corrupt gang who have taken over PL and Malta!!!!",
        "likes": "17",
        "dislikes": "0",
        "replies": []
      },
      "c78402ec944c09f1": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 9:46 PM",
        "published_date_timestamp": 1715024760,
        "comment": "Pathetic!",
        "likes": "8",
        "dislikes": "0",
        "replies": []
      },
      "114d58c765b0432f": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 9:51 PM",
        "published_date_timestamp": 1715025060,
        "comment": "In my opinion the inquiry treated everybody very fairly and there is no reason to believe that my opinion is less valid than Robert's.  After all he has not read the report either, he says.",
        "likes": "14",
        "dislikes": "1",
        "replies": []
      },
      "a3be9042dc634a4e": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 9:51 PM",
        "published_date_timestamp": 1715025060,
        "comment": "MAFIA FROM DAY ONE PLEASE ADMIT!!!!",
        "likes": "9",
        "dislikes": "0",
        "replies": []
      },
      "cd98861ca375dbe3": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 10:01 PM",
        "published_date_timestamp": 1715025660,
        "comment": "Do you genuinely think your audience consists solely of village idiots? It would be wise to diffuse incitement that Manual Cuschieri is stirring before things escalate. RA, try to man-up. It's time to take responsibility and show strength by refraining from undermining democracy through distorted reasoning to manipulate election results based on the findings of a magisterial inquiry into corruption. Your approach is misguided. It's the court, not die-hard Labour supporters, who ultimately determine the outcome.",
        "likes": "2",
        "dislikes": "0",
        "replies": []
      },
      "318565d4ad0db981": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 10:03 PM",
        "published_date_timestamp": 1715025780,
        "comment": "'People should ask why inquiry treated Muscat and other officials unfairly' - PM.Why should they ask that, especially as it is not true?",
        "likes": "2",
        "dislikes": "0",
        "replies": []
      },
      "28be715bdefabb9d": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 10:07 PM",
        "published_date_timestamp": 1715026020,
        "comment": ".....What ? 30 Million Euros of frozen assets !!",
        "likes": "0",
        "dislikes": "0",
        "replies": []
      },
      "49ecf9910bbd327d": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 10:11 PM",
        "published_date_timestamp": 1715026260,
        "comment": "Abela is desperately trying to grasp control of a situation that threatens to overwhelm him and his party by hijacking the conversation with wild accusations at anything and everyone remotely opposing him. Never mind the the content of the findings of the enquiry, kill the messenger.In doing so he has completely abdicated his role of Prime Minister and has shown utter disregard to the reputational damage of Malta.",
        "likes": "3",
        "dislikes": "0",
        "replies": []
      },
      "d32c2ac33da86c08": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 10:25 PM",
        "published_date_timestamp": 1715027100,
        "comment": "And court experts were paid too much in “direct orders”, he added.Now that made me laugh...thanks Bob.",
        "likes": "1",
        "dislikes": "0",
        "replies": []
      },
      "5b9855d803ae3a52": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 10:26 PM",
        "published_date_timestamp": 1715027160,
        "comment": "Straws clutching at.......",
        "likes": "1",
        "dislikes": "0",
        "replies": []
      },
      "95a0d6ff858cbf69": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 10:26 PM",
        "published_date_timestamp": 1715027160,
        "comment": "While insisting that “he had not seen the inquiry”, Bobo Abela asserts that, “The Vitals magisterial inquiry is riddled with unjust accusations”.This begs the logical question - if Bobo \"hasn’t seen the inquiry\"  how is it that he describes it as “riddled with unjust accusations”?  Have you had an illegal sneak preview of the inquiry’s report or are you just blowing smoke Bobo?  Which one is it?  A liar caught in his own lies.  Il-giddieb għomru qasir.Bobo brings to mind the observation made by the American playwright Tennessee Williams, “The only thing worse than a liar is a liar that's also a hypocrite.”",
        "likes": "8",
        "dislikes": "0",
        "replies": [
          {
            "5e4b00feb951b097": {
              "author": "[REDACTED]",
              "published_date": "Tuesday, May 7, 2024 9:29 AM",
              "published_date_timestamp": 1715066940,
              "comment": "theres a saying LIAR LIAR PANTS ON FIRE",
              "likes": "2",
              "dislikes": "0",
              "replies": []
            }
          }
        ]
      },
      "6121cadff604deab": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 10:30 PM",
        "published_date_timestamp": 1715027400,
        "comment": "'People should ask why inquiry treated Muscat and other officials unfairly' - PMHow does he know?He has not read the report either, he says..So he has  the 6th sense and he tells nobody",
        "likes": "2",
        "dislikes": "0",
        "replies": []
      },
      "fc25b9c370c37158": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 10:40 PM",
        "published_date_timestamp": 1715028000,
        "comment": "Is our PM afraid of something because the way he is acting is very odd. The people want nothing but justice.",
        "likes": "3",
        "dislikes": "0",
        "replies": [
          {
            "18c3ea4467ea0f59": {
              "author": "[REDACTED]",
              "published_date": "Tuesday, May 7, 2024 8:26 AM",
              "published_date_timestamp": 1715063160,
              "comment": "Perhaps his name is there as well",
              "likes": "3",
              "dislikes": "0",
              "replies": []
            }
          }
        ]
      },
      "b21404d5fcf5be57": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 10:56 PM",
        "published_date_timestamp": 1715028960,
        "comment": "The facts of the day are  that Steward Health Care is filing for bankruptcy in the USA and that the Maltese AG is pressing charges against Muscat, Mizzi , Schembri and others. Whether these 2 facts are consequential of each other we cannot yet say, however let the conversation on this subject be mature  and not partisan. The country has been waiting 5 years for clarification where the about 400 million euros  paid to Steward from the Maltese Treasury have  landed and now we expect to get some answers.",
        "likes": "5",
        "dislikes": "0",
        "replies": []
      },
      "41f182249e76a691": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 11:19 PM",
        "published_date_timestamp": 1715030340,
        "comment": "are innocent until proven guilty and there is no reason why they should be kicked out of their positions, Robert Abela said on Monday. Robert, please note that in a normal democratic country, a person accused of something steps down from their position and is not re-instated till they clear their name.",
        "likes": "5",
        "dislikes": "0",
        "replies": []
      },
      "c758400e723eba19": {
        "author": "[REDACTED]",
        "published_date": "Monday, May 6, 2024 11:19 PM",
        "published_date_timestamp": 1715030340,
        "comment": "The establishment that humiliated Adrian Delia. How very true.",
        "likes": "0",
        "dislikes": "2",
        "replies": []
      },
      "12a7aed2b9ab6917": {
        "author": "[REDACTED]",
        "published_date": "Tuesday, May 7, 2024 12:06 AM",
        "published_date_timestamp": 1715033160,
        "comment": "He also admitted that he speaks to Muscat regularly because \"he's the former pm\" - what a wimpish alibi. They talk about their 2019 back scratching agreement terms.",
        "likes": "4",
        "dislikes": "0",
        "replies": []
      },
      "42c63446db5ee7be": {
        "author": "[REDACTED]",
        "published_date": "Tuesday, May 7, 2024 12:39 AM",
        "published_date_timestamp": 1715035140,
        "comment": "Emm.. mela m'ghadomx jahdmu minghajr indhil l-istituzzjonijiet issa? Asking for a friend :)   https://talk.mt/abela-jghid...",
        "likes": "1",
        "dislikes": "0",
        "replies": []
      },
      "74b8c98a6560d3d2": {
        "author": "[REDACTED]",
        "published_date": "Tuesday, May 7, 2024 1:09 AM",
        "published_date_timestamp": 1715036940,
        "comment": "This is by far the worst prime minister malta ever had and the people need to broaden their horizon, do you think foreign private investors would choose malta with this kind of language by, of all people, the prime minister,",
        "likes": "6",
        "dislikes": "0",
        "replies": []
      },
      "9341ccc171d2fee3": {
        "author": "[REDACTED]",
        "published_date": "Tuesday, May 7, 2024 2:27 AM",
        "published_date_timestamp": 1715041620,
        "comment": "What is fair then Mr PM, robbing 400mn off the Maltese people ?",
        "likes": "4",
        "dislikes": "0",
        "replies": []
      },
      "f83977d7efd1169b": {
        "author": "[REDACTED]",
        "published_date": "Tuesday, May 7, 2024 3:52 AM",
        "published_date_timestamp": 1715046720,
        "comment": "“ The same goes for Edward Scicluna, he added.” Edward Scicluna is the one man who can never escape this. Not only did he not do his job while in office as finance minister. But only thanks to his recklessness and lack of vigilance were these criminals able to do what they have done to this country and to the taxpayer. That’s instead of protecting the country’s coffers. Let’s be clear. This is nothing less than treason by the semi retired Central Bank Governor.",
        "likes": "5",
        "dislikes": "0",
        "replies": []
      }
    }
  }